src/Documents/ВыполнениеРаботНадПроектом/ВыполнениеРаботНадПроектом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыполнениеРаботНадПроектом</name>
  <registerRecords>InformationRegister.ВремяВыполненияПроектов</registerRecords>
  <registerRecords>InformationRegister.УП_ВремяВыполнениеПроектов_Факт</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Исполнители</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненияДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ВыполнениеРаботНадПроектом/Forms/ФормаДокумента/Module.bsl
#Область Прочее

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Для каждого ТекСтрока Из ВыбранноеЗначение.Корзина Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Клиент", ТекСтрока.Клиент);
		ПараметрыОтбора.Вставить("Проект", ТекСтрока.Проект);
		НайденныеСтроки = ДокументОбъект.Проекты.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока        = ДокументОбъект.Проекты.Добавить();
			НоваяСтрока.Клиент = ТекСтрока.Клиент;
			НоваяСтрока.Проект = ТекСтрока.Проект;
		КонецЕсли;
	КонецЦикла;
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьИтоговыеПоказателиПоступления(Форма)
	
	ВремяВыполнения = 0;
	Для каждого ТекСтрока Из Форма.Объект.Проекты Цикл
		ВремяВыполнения = ВремяВыполнения + УП_ОбщегоНазначения_Сервер.ПреобразоватьВремя(ТекСтрока.ВремяВыполнения);
	КонецЦикла;
	Форма.ВремяВыполнения = УП_ОбщегоНазначения_Сервер.ПреобразоватьЧислоВВремя_Строка(ВремяВыполнения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УП_РаботаСДокументамиСервер.Документ_ПриСозданииНаСервере(РеквизитФормыВЗначение("Объект"), ЭтотОбъект.Объект);
	
	Если РольДоступна("УП_УдаленныйИсполнитель") Тогда
		Элементы.Исполнитель.Доступность   = Ложь;
		Элементы.Ответственный.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УП_РаботаСДокументамиКлиент.Документ_ПриОткрытии(Объект, Элементы);
	
	РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектыПриИзменении(Элемент)
	
	РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Для каждого ТекСтрока Из Объект.Проекты Цикл
			Если НЕ ЗначениеЗаполнено(ТекСтрока.ВремяВыполнения) ИЛИ ТекСтрока.ВремяВыполнения = "00:00" Тогда
				Сообщение       = Новый СообщениеПользователю;
				Сообщение.Текст = "Необходимо указать время выполнения";
				Сообщение.Поле  = "ТекСтрока.ВремяВыполнения";
				Сообщение.УстановитьДанные(Объект);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПроектыВремяВыполненияПриИзменении(Элемент)
	
	Элементы.Проекты.ТекущиеДанные.ВремяВыполнения = СтрЗаменить(Элементы.Проекты.ТекущиеДанные.ВремяВыполнения, " ", 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПроектов(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДатаДокумента", Объект.Дата);
	ПараметрыФормы.Вставить("Контрагент"   , Объект.Контрагент);
	
	ПараметрЗаголовок = НСтр("ru = 'Подбор проектов в %Документ%'");
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", Объект.Ссылка);
	Иначе
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", НСтр("ru = 'выполнение работ над проектом'"));
	КонецЕсли;
	ПараметрыФормы.Вставить("Заголовок", ПараметрЗаголовок);
	
	ОткрытьФорму("Обработка.ПодборПроектов.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти
